-- --------------------------------------------------------
-- 호스트:                          127.0.0.1
-- 서버 버전:                        10.5.8-MariaDB - mariadb.org binary distribution
-- 서버 OS:                        Win64
-- HeidiSQL 버전:                  11.0.0.5919
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;


-- test2 데이터베이스 구조 내보내기
CREATE DATABASE IF NOT EXISTS `test2` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `test2`;

-- 테이블 test2.board 구조 내보내기
CREATE TABLE IF NOT EXISTS `board` (
  `b_idx` int(10) NOT NULL AUTO_INCREMENT,
  `b_title` varchar(255) NOT NULL,
  `b_content` varchar(255) NOT NULL,
  `b_writer` varchar(255) NOT NULL,
  `b_date` varchar(50) NOT NULL DEFAULT '',
  `b_brdhit` varchar(255) NOT NULL,
  `b_file` varchar(255) DEFAULT NULL,
  `b_sfile` varchar(255) DEFAULT NULL,
  `b_group` int(11) NOT NULL DEFAULT 0,
  `b_order` int(11) NOT NULL DEFAULT 0,
  `b_depth` int(11) NOT NULL DEFAULT 0,
  `u_idx` int(11) DEFAULT NULL,
  PRIMARY KEY (`b_idx`)
) ENGINE=InnoDB AUTO_INCREMENT=40 DEFAULT CHARSET=utf8;

-- 테이블 데이터 test2.board:~39 rows (대략적) 내보내기
/*!40000 ALTER TABLE `board` DISABLE KEYS */;
INSERT INTO `board` (`b_idx`, `b_title`, `b_content`, `b_writer`, `b_date`, `b_brdhit`, `b_file`, `b_sfile`, `b_group`, `b_order`, `b_depth`, `u_idx`) VALUES
	(1, '일', '일일', 'a', '2021-03-24', '89', '', '', 1, 0, 0, NULL),
	(2, '이', '이이', 'b', '2021-03-24', '48', '', '', 2, 0, 0, NULL),
	(3, '삼삼삼', '삼삼asdfsgsdfsfdsf', 'c', '2021-03-25', '71', '', '', 3, 0, 0, NULL),
	(4, '사', '사사', 'd', '2021-03-25', '79', '', '', 4, 0, 0, NULL),
	(5, '오', '오오', 'e', '2021-03-26', '60', '', '', 5, 0, 0, NULL),
	(6, '육', '육육', 'f', '2021-03-26', '72', '', '', 6, 0, 0, NULL),
	(7, '칠', '칠칠', 'g', '2021-03-27', '36', '', '', 7, 0, 0, NULL),
	(8, '팔', '팔팔', 'h', '2021-03-28', '162', '', '', 8, 0, 0, NULL),
	(9, '구', '구구', 'i', '2021-03-28', '55', '', '', 9, 0, 0, NULL),
	(10, '십', '십십', 'j', '2021-03-29', '58', '', '', 10, 0, 0, NULL),
	(11, '십일', '십일십일', 'k', '2021-03-29', '87', '', '', 11, 0, 0, NULL),
	(12, '십이', '십이십이', 'l', '2021-03-30', '13', '', '', 12, 0, 0, NULL),
	(13, '십삼', '십삼십삼', 'm', '2021-03-30', '73', '', '', 13, 0, 0, NULL),
	(14, '십사', '십사십사', 'n', '2021-03-31', '15', '', '', 14, 0, 0, NULL),
	(15, '십오', '십오십오', 'o', '2021-03-31', '75', '', '', 15, 0, 0, NULL),
	(16, '십육', '십육십육', 'p', '2021-04-01', '46', '', '', 16, 0, 0, NULL),
	(17, '십칠', '십칠십칠', 'q', '2021-04-01', '75', '', '', 17, 0, 0, NULL),
	(18, '십팔', '십팔십팔', 'r', '2021-04-02', '30', '', '', 18, 0, 0, NULL),
	(19, '십구', '십구십구', 's', '2021-04-02', '105', '', '', 19, 0, 0, NULL),
	(20, '이십', '이십이십', 't', '2021-04-14', '3', '1', '', 20, 0, 0, NULL),
	(21, '이십일', '이일이일', 'u', '2021-04-14 ', '21', '1', '', 21, 0, 0, NULL),
	(22, '이십이', '이이이이', 'v', '2021-04-14 10:35:32', '2', '1', '', 22, 0, 0, NULL),
	(23, '이십삼', '이삼이삼', '1', '2021-04-14 11:50:38', '0', '0', '', 23, 0, 0, NULL),
	(24, '이십사', '이사이사', '칠', '2021-04-14 11:59:46', '25', '13.txt', '', 24, 0, 0, 10),
	(25, '이십오', '이오이오', '칠', '2021-04-14 12:19:48', '18', '1.txt', '', 25, 0, 0, 10),
	(26, '이십육', '이육이육', '칠', '2021-04-15 12:40:54', '25', '업로드3.txt', NULL, 26, 0, 0, 10),
	(27, '이십칠', '이칠이칠', '칠', '2021-04-15 12:49:49', '1', '16.txt', NULL, 27, 0, 0, 10),
	(28, '이십팔', '이팔이팔', '칠', '2021-04-16 10:54:10', '8', '2.txt', '2.txt', 28, 0, 0, 10),
	(29, '이십구', '이구이구', '칠', '2021-04-16 10:54:46', '18', '2.txt', '21.txt', 29, 0, 0, 10),
	(30, '삼십', '삼십삼십', '칠', '2021-04-16 12:28:38', '12', '업로드.txt', '업로드4.txt', 30, 0, 0, 10),
	(31, '삼십일', '삼일삼일', '칠', '2021-04-16 12:29:31', '22', 'upload.txt', 'upload.txt', 31, 0, 1, 10),
	(32, '삼십이', '삼이삼이', '칠', '2021-04-22 11:22:07', '6', '3.txt', '3.txt', 32, 0, 1, 10),
	(33, '삼십삼', '삼삼삼삼', '만세', '2021-06-03 12:50:50', '9', NULL, NULL, 33, 0, 1, 7),
	(34, '삼십사', '삼사삼사', '만세', '2021-06-11 11:30:26', '1', '1.txt', '112.txt', 34, 0, 1, 7),
	(35, '가나다', '가나다', '만세', '2021-06-14 15:12:25', '1', '1.txt', '113.txt', 34, 3, 2, 7),
	(36, '가나다2', '가나다2', '만세', '2021-06-14 15:13:28', '1', '1.txt', '114.txt', 34, 2, 2, 7),
	(37, '가나다3', '가나다3', '만세', '2021-06-14 15:21:13', '0', NULL, NULL, 34, 1, 2, 7),
	(38, '가나다1-1', '1-1', '만세', '2021-06-14 15:26:05', '1', NULL, NULL, 34, 4, 3, 7),
	(39, '가나다1-1-1', '1-1-1', '만세', '2021-06-14 15:36:35', '0', NULL, NULL, 34, 5, 4, 7);
/*!40000 ALTER TABLE `board` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
